//  Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее

 /*   
// Ввод данных

        int num1;
        int num2;

        Console.Write("Введите первое число: ");
        num1 = Convert.ToInt32(Console.ReadLine());

        Console.Write("Введите второе число: ");
        num2 = Convert.ToInt32(Console.ReadLine());
        int max = num1;
// Условия вывода данных
        if (num2 > max) max = num2;
    

// Вывод даных
        Console.Write("Максимальное число: " + max);
    
*/
